In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('titanic.csv')

In [3]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [4]:
df.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [5]:
df.Age.fillna(round(df.Age.mean(), 0), inplace = True )

In [6]:
df.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age              0
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [7]:
df.dropna(subset=['Embarked'], inplace=True)

In [8]:
df.drop(['PassengerId', 'Name', 'Ticket', 'Cabin'], axis=1, inplace=True)

In [9]:
df.head()

   Survived  Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0         0       3    male  22.0      1      0   7.2500        S
1         1       1  female  38.0      1      0  71.2833        C
2         1       3  female  26.0      0      0   7.9250        S
3         1       1  female  35.0      1      0  53.1000        S
4         0       3    male  35.0      0      0   8.0500        S

In [10]:
df.Embarked.value_counts()

S    644
C    168
Q     77
Name: Embarked, dtype: int64

In [11]:
df.loc[df.Embarked=='S', 'Embarked']=1
df.loc[df.Embarked=='C', 'Embarked']=2
df.loc[df.Embarked=='Q', 'Embarked']=3

In [12]:
df.loc[df.Sex=='male', 'Sex']=0
df.loc[df.Sex=='female', 'Sex']=1

In [13]:
from sklearn.model_selection import train_test_split

In [14]:
X_train, X_test, y_train, y_test = train_test_split(df.drop('Age', axis=1), 
                                                    df.Age, 
                                                    test_size=0.30, 
                                                    random_state=42)

In [17]:
#from sklearn.tree import DecisionTreeClassifier
from sklearn.linear_model import LinearRegression

In [18]:
#clf = DecisionTreeClassifier()
lr = LinearRegression()

In [19]:
#clf.fit(X_train, y_train)
lr.fit(X_train,y_train)

LinearRegression()

In [21]:
pred = lr.predict(X_test)

In [25]:
#from sklearn.metrics import f1_score
from sklearn.metrics import mean_absolute_error

In [27]:
#print('качество на тесте ', f1_score(y_test,pred))
print('Ошибка на тесте', mean_absolute_error(y_test, pred))

Ошибка на тесте 8.664838209600983

In [28]:
print('Ошибка на обучающей выборке', mean_absolute_error(y_train, lr.predict(X_train)))

Ошибка на обучающей выборке 9.089462355595762